[
  {
    "path": "posts/2022-05-25-bagaimana-katadata-menganalisis-preferensi-pendengar-indonesia-di-spotify/",
    "title": "Bagaimana Katadata menganalisis preferensi pendengar Indonesia di Spotify?",
    "description": "Katadata mengumpulkan lagu-lagu yang paling sering diputar di Spotify dan daftar putar yang berkaitan dengan genre populer utama, termasuk dangdut",
    "author": [],
    "date": "2022-05-25",
    "categories": [
      "data-journalism",
      "Katadata",
      "Spotify"
    ],
    "contents": "\r\n\r\nContents\r\nData\r\nValensi\r\nDaftar putar Lagu\r\nTeratas\r\nLagu-lagu genre populer\r\nutama\r\nPenutup\r\nReferensi\r\n\r\nPada hari Senin, 23 Mei 2022, Katadata menerbitkan artikel yang menganalisis preferensi pendengar\r\nIndonesia dan mood lagu-lagu dengan genre populer utama. Kami\r\nmengumpulkan data dari platform pemutar audio Spotify.\r\nTulisan ini akan menjelaskan proses, asumsi dan keputusan-keputusan\r\ndi balik analisis tersebut. Lebih penting lagi, tulisan ini juga\r\nmembahas keterbatasan dari analisis ini dan bagaimana menerjemahkan\r\ndatanya dengan mempertimbangkan keterbatasan tersebut.\r\nSaya tidak akan membahas sisi teknis dari analisis tersebut secara\r\nmendetail di sini. Namun, anda bisa cek kode dan data yang kami gunakan\r\nuntuk menulis artikel tersebut di repository GitHub ini.\r\nData\r\nKami menggunakan dua himpunan data. Pertama, kami mengumpulkan\r\nlagu-lagu yang paling sering diputar. Untuk data ini, kami menggunakan\r\ndaftar putar Lagu Teratas yang tersedia untuk 58 negara dan daerah di\r\nSpotify, termasuk Indonesia. Daftar putar ini, yang diperbarui setiap\r\nminggu, berisi 50 lagu.\r\nSet data ini memberikan kami 2.900 lagu secara keseluruhan. Daftar\r\nputar yang kami gunakan ini terakhir diperbarui pada 13 Mei 2022.\r\nLagu-lagu tersebut tidak unik. Walaupun proses pembersihan data pada\r\numumnya menyingkirkan duplikat, kami membiarkannya karena pendengar di\r\nIndonesia dan Afrika Selatan mungkin sering memutar lagu yang sama. Lagu\r\n“As It Was” dari Harry Styles, misalnya, muncul di 55 daftar putar Lagu\r\nTeratas.\r\nKedua, kami menggunakan fasilitas pencarian di Spotify untuk\r\nmengumpulkan lagu-lagu sekaligus mengelompokkannya secara longgar\r\nmenurut genre. Kami menggunakan masing-masing genre sebagai kata kunci.\r\nKemudian kami mengarahkan pencariannya ke daftar putar yang berkaitan\r\ndengan genre tersebut, baik yang dikurasi oleh Spotify ataupun\r\npengguna.\r\nAda beberapa pengaturan yang penting terkait pencariannya. Pertama,\r\nkami hanya mengumpulkan lagu-lagu (dari berbagai musisi di berbagai\r\nnegara) yang tersedia di pasar Indonesia. Kedua, kami membatasi hasil\r\npencariannya ke 50 daftar lagu yang pertama muncul untuk masing-masing\r\ngenre. Ketiga, kami hanya mengumpulkan 100 lagu pertama dari setiap\r\ndaftar putar.\r\nTentu, tidak semua pencarian memberikan persis 50 daftar putar dan\r\ntidak semua daftar putar memiliki 100 lagu, apalagi lebih.\r\nKami menggunakan artikel Wikipedia soal genre untuk memperoleh daftar\r\ngenre populer utama. Berdasarkan daftar tersebut, kami memilih sembilan\r\nyang relatif lebih relevan untuk konteks analisis kami, yaitu\r\nelektronik, hip hop, jazz, pop, punk, reggae, rock, metal dan R&B.\r\nLalu kami menambahkan dangdut, karena… siapa yang bisa bilang tidak ke\r\nlagu-lagu Didi Kempot?\r\nSet data ini memberikan kami 30.169 lagu. Lagi-lagi, kami membiarkan\r\nduplikat antargenre karena satu lagu bisa dianggap cocok dengan lebih\r\ndari satu genre.\r\nNamun, kami perlu menghapus beberapa lagu. Pertama, lagu yang tidak\r\nmemiliki nilai untuk valensi, sebuah karakteristik audio yang kami\r\nperlukan untuk analisis. Kedua, lagu-lagu yang berdurasi lebih dari 10\r\nmenit. Ketiga, lagu-lagu yang memiliki karakteristik mirip dengan gelar\r\nwicara, buku yang dibacakan (audiobook) atau puisi. Proses\r\npembersihan ini menyisakan kami dengan 30.013 lagu.\r\n\r\n\r\nSampel lagu menurut genre\r\n    Genre\r\n      n\r\n    Jazz\r\n3.597Punk\r\n3.350Electronic\r\n3.312Hip hop\r\n3.287Pop\r\n3.249Rock\r\n3.222R&B\r\n3.076Reggae\r\n2.684Metal\r\n2.454Dangdut\r\n1.782Sumber: Spotify; analisis penulis\r\n    Tabel: penulis\r\n    \r\n\r\nValensi\r\nKami tertarik untuk mengetahui preferensi pendengar Indonesia\r\nberdasarkan mood lagu. Untuk itu, kami menggunakan valensi.\r\nSpotify menyusun ukuran persepsi ini untuk menggambarkan “kepositifan\r\nmusik” sebuah lagu dengan skala antara 0 dan 1. Algoritme ini dilatih\r\nberdasarkan peringkat kepositifan lagu oleh para ahli, menurut media\r\nmingguan The Economist.\r\nLagu dengan valensi yang tinggi terdengar lebih positif, misalnya\r\nbahagia, ceria atau antusias. Sebaliknya, lagu dengan valensi yang\r\nrendah terdengar lebih negatif, misalnya sedih, murung atau marah.\r\nNamun, tidak semua lagu dengan lirik yang murung memiliki valensi\r\nyang rendah, seperti lagu “Hati-Hati di Jalan” oleh Tulus.\r\nAda dua variabel lain yang relevan untuk memahami ini. Pertama,\r\ndanceability, yang menggambarkan seberapa cocok sebuah lagu\r\nuntuk berdansa atau menari dalam skala antara 0 dan 1 menurut “tempo,\r\nstabilitas ritme, kekuatan ketukan dan keteraturan keseluruhan.” Kedua,\r\nenergi, sebuah ukuran persepsi terkait intensitas dan aktivitas dengan\r\nskala yang sama. Lagu yang energik biasanya terdengar cepat, keras dan\r\nberisik.\r\nValensi memiliki korelasi positif dengan danceability dan\r\nenergi. Lagu “Hati-Hati di Jalan” memiliki danceability dan\r\nenergi yang lumayan tinggi, yaitu masing-masing 0,64 dan 0,43.\r\n\r\n\r\n\r\nWalaupun mencerminkan mood lagu, valensi\r\nbelum tentu mewakili kebahagiaan pendengar. Bagi\r\nsebagian orang, suasana hati menentukan lagu yang mereka pilih.\r\nKadang-kadang, saya juga begitu. Tapi lagu yang sering saya putar\r\nbelum tentu mencerminkan suasana hati saya. Saya lumayan sering memutar\r\nlagu “Both Sides Now” dari Joni Mitchell. Lagu ini mendapat valensi\r\nserendah 0,26. Tapi bukan berarti saya sering murung. (Atau iya? 🤔)\r\nDaftar putar Lagu Teratas\r\nDaftar putar Lagu Teratas Indonesia memperoleh 34.594 suka per 22 Mei\r\n2022; Lagu Teratas Global memperoleh 767.121 suka pada waktu yang sama.\r\nWalaupun jumlah suka ini (dan jumlah pemutaran lagu-lagunya) belum tentu\r\nmewakili selera semua pengguna Spotify, daftar putar ini cukup baik\r\nuntuk memperkirakan preferensi pendengar pada umumnya.\r\nNamun, daftar putar ini hanya menggambarkan lagu-lagu yang paling\r\nsering diputar dalam periode tertentu, terutama ketika datanya\r\ndikumpulkan.\r\nDengan demikian, kami tidak bisa menggeneralisasi temuan analisisnya\r\nke periode lain. Preferensi pendengar di Indonesia pada pertengahan\r\nbulan Mei mungkin berbeda dengan akhir bulan Desember. Lagu-lagu yang\r\nceria mungkin lebih sering diputar dari biasanya menjelang Natal dan\r\ntahun baru.\r\nThe Economist menemukan bahwa terdapat pola musiman dalam\r\npreferensi pendengar di Spotify, berdasarkan analisis terhadap 200 lagu\r\nyang paling sering diputar per hari antara 1 Januari 2017 dan 29 Januari\r\n2020.\r\nLagu-lagu genre populer\r\nutama\r\nKlasifikasi tidak selalu mudah, mungkin terutama dalam seni seperti\r\nmusik. Kami mengelompokkan lagu-lagu berdasarkan daftar putar yang\r\nberkaitan dengan masing-masing genre menggunakan fasilitas pencarian\r\nSpotify. Tentu, seharusnya ada cara yang lebih teliti dari ini.\r\nKami tidak ingin mengklaim bahwa sampel kami representatif. Kami\r\ntidak mencakup semua genre populer utama, seperti country,\r\nlatin atau funk. Kami juga tidak melakukan klasifikasi berdasarkan genre\r\nturunan atau yang berkaitan. Untuk konteks Indonesia, kami tidak\r\nmemasukkan genre yang berkaitan dengan wilayah atau etnis tertentu,\r\nseperti lagu Batak.\r\nDaftar putar yang kami kumpulkan sebagian dikurasi oleh pengguna,\r\nsehingga selera dan pengetahuan mereka menentukan lagu apa saja yang\r\nmasuk ke dalam daftar putarnya. Sementara itu, tidak semua pengguna\r\n(termasuk saya) memiliki keahlian dalam musik, apalagi menentukan genre\r\nsebuah lagu.\r\nJumlah hasil pencarian terhadap daftar putar (dan lagu-lagu di\r\ndalamnya) juga menentukan kualitas set datanya. Semakin banyak daftar\r\nputar yang dikumpulkan, semakin besar kemungkinan menemukan lagu yang\r\nmungkin terdengar tidak cocok dikelompokkan dalam genre tertentu.\r\nMisalnya, lagu “Pelangi” dari HiVi! masuk ke salah satu daftar putar\r\nyang muncul dalam pencarian dengan kata kunci “jazz” di Spotify.\r\nDengan banyaknya lagu yang memiliki ciri-ciri yang cocok dengan lebih\r\ndari satu genre, tidak mudah untuk menentukan apakah sebuah lagu relevan\r\nuntuk genre tertentu dalam skala yang besar, apalagi memisahkan mana\r\nyang salah diklasifikasi.\r\nBeberapa genre mungkin memiliki ciri khas yang mudah dikenali,\r\nseperti rap. Lagu-lagunya bisa dikenali dengan salah satu karakteristik\r\naudio yang disediakan oleh Spotify, yaitu speechiness.\r\nTerakhir, kami berusaha untuk memperkirakan tren mood lagu\r\nmasing-masing genre dengan rata-rata valensi. Namun, data agregasi\r\nseperti ini hanya satu bagian dari gambar yang lebih besar. Dalam jazz\r\nyang cenderung terdengar murung menurut rata-rata valensinya, ada\r\nlagu-lagu seperti “Mati Saja” dari Barry Likumahuwa yang terdengar\r\npositif menurut Spotify.\r\n\r\n\r\n\r\nPenutup\r\nTerlepas dari semua ini, saya hanya berharap artikelnya memberikan\r\njeda yang menghibur dari berita-berita serius.\r\nReferensi\r\nExploring the Spotify API with R: A tutorial for\r\nbeginners, by a beginner oleh Mia Smith\r\nUnderstanding + classifying genres using Spotify audio\r\nfeatures oleh Kaylin Pavlik\r\nData from Spotify suggest that listeners are gloomiest\r\nin February oleh The Economist\r\nCek juga #TidyTuesday\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-05-25-bagaimana-katadata-menganalisis-preferensi-pendengar-indonesia-di-spotify/images/preview-analisis-katadata-mood-lagu-spotify.png",
    "last_modified": "2022-05-25T15:57:28+07:00",
    "input_file": {},
    "preview_width": 1201,
    "preview_height": 631
  },
  {
    "path": "posts/2022-03-18-my-data-driven-stories-on-the-jakarta-post/",
    "title": "My data-driven stories on The Jakarta Post",
    "description": "A recap of my data journalism at The Jakarta Post between 2021 and 2022. From the COVID-19 pandemic's impact on wages to the decline in homeownership",
    "author": [],
    "date": "2022-03-18",
    "categories": [
      "data-visualization",
      "data-journalism",
      "The-Jakarta-Post"
    ],
    "contents": "\r\nDo you know that The Jakarta Post (JakPost) has been publishing\r\ndata-driven stories? JakPost did not have a data journalism desk or\r\nsection on the website and the newspaper. But my colleagues and I had\r\nbeen wrangling data to find stories.\r\nThis post compiles the data visualizations from my 14 selected\r\nstories between mid-2021 and March 2022. Since there was no data\r\njournalism desk, I worked on these stories with the business desk. So my\r\nstories are largely related to the impact of COVID-19 on\r\nlivelihoods.\r\nWhen working on these stories, I was still learning and trying to\r\nfigure out some stuff. (Actually, I still do.) Writing this post,\r\ntherefore, has allowed me to not just look back at what I’ve achieved,\r\nbut also see what I could have done better. As a result, I recreated the\r\ncharts and map with a couple improvements where necessary.\r\nYou can find the code and data behind these visualizations in this GitHub\r\nrepository. The repo also tells you the changes I’ve made to\r\nthem.\r\nEnjoy!\r\nIndonesia\r\nremains Java-centric despite Jokowi’s infrastructure campaign\r\nMay 23, 2021\r\nRead the story on this\r\nlink.\r\nThe first chart in this story shows that population and economic\r\ndevelopment had remained too concentrated in Java between 1971 and\r\n2020.\r\n\r\n\r\n\r\nThe second chart shows that provinces with a higher per capita income\r\ntended to have more incoming lifetime migrants relative to their\r\npopulation.\r\n\r\n\r\n\r\nThe following map shows that lifetime migrants also tended to choose\r\nneighboring provinces or the ones closest to their home.\r\n\r\n\r\n\r\nCOVID-19 takes severe toll\r\non wages\r\nJune 14, 2021\r\nRead the story on this\r\nlink.\r\nThe first chart in this story shows that the average net wage in real\r\nterms declined in August 2020 from a year earlier, while the\r\nunemployment rate rose sharply to a level not seen at least in the past\r\nfour years.\r\n\r\n\r\n\r\nThe second chart shows that sectors that fared better, such as\r\ninformation and communication, recorded a smaller decline in its real\r\nwage. Meanwhile, hard-hit sectors like transportation and storage\r\nrecorded a steeper decline in its real wage.\r\n\r\n\r\n\r\nThe next chart shows that while the average net wage in the majority\r\nof provinces stayed above the minimum wage in nominal terms, it fell to\r\na level below the floor in Jakarta or even further below the floor in\r\nsome provinces, such as West Sulawesi.\r\n\r\n\r\n\r\nIndonesian\r\nhomeownership slides as affordability issues arise\r\nJune 28, 2021\r\nRead the story on this\r\nlink.\r\nThe first chart in this story shows that homeownership slightly fell\r\nbetween 1999 and 2020 in general. Bali and Jakarta recorded a\r\nsignificant decline, while Bengkulu and Jambi recorded a small increase\r\nin homeownership.\r\n\r\n\r\n\r\nThe next chart shows that house prices had been growing at a slower\r\npace at least since 2014. In Bandar Lampung, Lampung, house prices\r\ndeclined during the pandemic.\r\n\r\n\r\n\r\nThe next chart shows that the average monthly mortgage payment in\r\nJakarta and Yogyakarta was unusually high in 2019, given the mortgage\r\nterms.\r\n\r\n\r\n\r\nFactory imports show\r\nrecovery uncertainty\r\nJuly 1, 2021\r\nRead the story on this\r\nlink.\r\nThis chart shows that imports of raw materials and capital goods had\r\nnot shown a promising sign of recovery as of April 2021. While imports\r\nof raw materials continued to pick up pace, imports of capital goods did\r\nnot.\r\n\r\n\r\n\r\nWealth\r\ngap narrows in Indonesia as stock market slumps, house prices grow\r\nJuly 12, 2021\r\nRead the story on this\r\nlink.\r\nThe first chart in this story shows the estimated wealth distribution\r\nin Indonesia between 2019 and 2020. As the share of wealth of the bottom\r\n40 percent slightly expanded while that of the richest 10 percent\r\nshrank, the wealth gap was estimated to narrow.\r\n\r\n\r\n\r\nThe second chart shows that wealth per adult in Indonesia continued\r\nto grow despite at a slower pace during the pandemic. The growth hinged\r\nlargely on nonfinancial assets like houses.\r\n\r\n\r\n\r\nSlow\r\nvaccination takes toll on Indonesia in uneven global recovery\r\nAugust 1, 2021\r\nRead the story on this\r\nlink.\r\nThe first chart in this story shows that the International Monetary\r\nFund (IMF) revised downward the 2021 economic growth forecast for\r\nIndonesia in its July outlook from the previous one. Indonesia joined\r\nother countries with a downward revision, such as India and neighboring\r\nMalaysia.\r\n\r\n\r\n\r\nThe second chart shows that Indonesia, like other low and\r\nlower-middle income countries, was falling behind its richer peers in\r\ninoculating its citizens against COVID-19. This trend is associated with\r\nthe growth outlook.\r\n\r\n\r\n\r\nEmergency\r\ncurbs reverse recovery in consumer confidence, retail sales\r\nAugust 12, 2021\r\nRead the story on this\r\nlink.\r\nThe first chart in this story shows that the Delta wave, which peaked\r\nin July 2021, interrupted the recovery in consumer confidence and retail\r\nsales. The consumer confidence index fell back to a level nearly as\r\npessimistic as in October 2020. The retail sales index also contracted\r\nagain compared with a year earlier.\r\n\r\n\r\n\r\nThe next chart shows that visitors to retail and recreation places\r\nstarted declining in June, even before the government tightened mobility\r\nrestrictions as cases surged, especially in Java and Bali.\r\n\r\n\r\n\r\nIndonesia\r\nlags behind in decoupling economic and emission growth\r\nSeptember 5, 2021\r\nRead the story on this\r\nlink.\r\nThe first chart in this story shows that Indonesia had not been able\r\nto grow its economy without slowing down both production and\r\nconsumption-based CO2 emissions between 1990 and 2020. Meanwhile, other\r\ncountries had managed to do so. Some countries, such as Singapore,\r\ndeveloped their economy while reducing its emissions.\r\n\r\n\r\n\r\nThe following chart shows that Indonesia’s human development index\r\n(HDI) might be below the threshold of high-human development if we\r\naccounted for emission and material footprint.\r\n\r\n\r\n\r\nMajority\r\nof affluent Indonesians plan to retire early\r\nDecember 11, 2021\r\nRead the story on this\r\nlink.\r\nThis chart shows that the share of affluent individuals planning to\r\nretire before turning 65 was highest in Indonesia among the surveyed\r\ncountries. As a result, the share of these individuals who had not\r\nstarted saving or investing for retirement was very low in the\r\ncountry.\r\n\r\n\r\n\r\nYearender\r\n2021: How the Delta wave disrupted Indonesia’s economic recovery\r\nDecember 26, 2021\r\nRead the story on this\r\nlink.\r\nThis chart shows how the Delta wave hit Indonesia when the rate of\r\nvaccination against the virus was still very low. This forced the\r\ngovernment to tighten mobility restrictions. As a result, the country\r\nrecorded a slower economic growth in the July to September period in\r\n2021 than the previous quarter.\r\n\r\n\r\n\r\nHow\r\nChina beats US as trade, investment partner for Indonesia\r\nJanuary 4, 2022\r\nRead the story on this\r\nlink.\r\nThe first chart in this story shows that the share of Indonesia’s\r\nexports to and imports from China started growing in early 2000s,\r\nfollowing the latter’s accession to the World Trade Organization (WTO).\r\nBy late 2000s, the share of trade with China was larger than that with\r\nthe United States (US).\r\n\r\n\r\n\r\nThe next chart shows that net foreign direct investment (FDI) flow\r\nfrom China to Indonesia largely remained positive between 2010 and 2020.\r\nMeanwhile, the flow from the US showed a downward trend in general.\r\n\r\n\r\n\r\nDomestic\r\ntravelers ‘not enough’ to revive Bali tourism\r\nJanuary 18, 2022\r\nRead the story on this\r\nlink.\r\nThis chart shows the large share of foreign guests at star-rated and\r\nother hotels in Bali in 2019. As a popular international tourist\r\ndestination, the province was heavily dependent on foreign tourists.\r\n\r\n\r\n\r\nCOVID-19\r\nexpedites deindustrialization in Indonesia\r\nFebruary 9, 2022\r\nRead the story on this\r\nlink.\r\nThis chart shows the premature deindustrialization that started\r\ntaking place in Indonesia in mid-2000s, as suggested by the share of\r\nmanufacturing value added in real gross domestic product (GDP), and how\r\nthe pandemic worsened it.\r\n\r\n\r\n\r\nCOVID-19\r\npulls more workers into low-paying service sector jobs\r\nMarch 5, 2022\r\nRead the story on this\r\nlink.\r\nThis chart shows that most Indonesian workers in services had less\r\nthan a college educational attainment in 2021. These workers were\r\nconcentrated in traditional and low-paying sectors, such as\r\naccommodation and food service activities, transportation and storage,\r\nand wholesale and retail trade.\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-03-18-my-data-driven-stories-on-the-jakarta-post/images/preview-jakpost-graphics.png",
    "last_modified": "2022-05-25T15:56:26+07:00",
    "input_file": {},
    "preview_width": 2560,
    "preview_height": 1280
  },
  {
    "path": "posts/2021-09-21-my-data-visualizations-in-2020/",
    "title": "My dataviz in 2020",
    "description": "One scatter plot, one animated scatter plot, one map and one table on industrial park, COVID-19 and well-being",
    "author": [],
    "date": "2021-09-21",
    "categories": [
      "data-visualization",
      "Datawrapper",
      "ggplot2",
      "gganimate",
      "The-Jakarta-Post"
    ],
    "contents": "\r\nI created dozens of data visualizations on various topics in 2020\r\nboth for work and personal projects. From COVID-19 to industrial\r\npark.\r\nI published my first “data-driven story” on poverty in Jakarta on The\r\nJakarta Post in February last year. Aside from analyzing data and\r\ncreating visualizations for work, I also do it outside work, mostly for\r\nlearning. I usually publish the result on my Twitter account.\r\nHere’s my favorite data visualizations from last year, with a few\r\nimprovements.\r\n\r\n\r\n\r\n\r\n\r\n\r\nTwitter\r\n\r\nJune 20, 2020\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe Jakarta Post\r\n\r\nJuly 17, 2020\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nTwitter\r\n\r\nJuly 19, 2020\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nTwitter\r\n\r\nSep. 9, 2020\r\n\r\n\r\n\r\n\r\n\r\nShow code\r\n\r\n# Packages ----\r\n\r\nlibrary(tidyverse)\r\nlibrary(gapminder)\r\nlibrary(gganimate)\r\n\r\n\r\n# Data ----\r\n\r\nasean5 <- c(\"Singapore\", \"Philippines\", \"Thailand\", \"Malaysia\")\r\n\r\ngapminderGrouped <- gapminder %>% \r\n  mutate(\r\n    pop = pop / 1000000,\r\n    group = case_when(\r\n      country == \"Indonesia\" ~ \"Indonesia\",\r\n      country %in% asean5 ~ \"ASEAN-5\",\r\n      TRUE ~ \"Rest of the world\"\r\n    )\r\n  )\r\n\r\n\r\n# Chart ----\r\n\r\ncolorPrimary <- \"#757575\"\r\ncolorPrimaryLight <- \"#E0E0E0\"\r\n\r\naxisBreakX <- c(100, 1000, 10000, 100000, 1000000)\r\n\r\nplotGapminder <- ggplot(\r\n  data = gapminderGrouped, \r\n  mapping = aes(x = gdpPercap, y = lifeExp)\r\n) +\r\n  geom_point(\r\n    mapping = aes(fill = group, size = pop),\r\n    pch = 21, \r\n    color = \"white\", \r\n    alpha = 0.85\r\n  ) +\r\n  scale_x_log10(\r\n    breaks = axisBreakX,\r\n    labels = format(axisBreakX, scientific = FALSE, big.mark = \",\"),\r\n    limits = c(100, 1000000)\r\n  ) +\r\n  scale_y_continuous(\r\n    breaks = seq(0, 100, 20),\r\n    limits = c(0, 100),\r\n    expand = c(0, 0),\r\n    position = \"right\"\r\n  ) +\r\n  scale_fill_manual(\r\n    values = c(\r\n      \"Indonesia\" = \"#2477B3\",\r\n      \"ASEAN-5\" = \"#55CBF2\",\r\n      \"Rest of the world\" = \"#BDBDBD\"\r\n    )\r\n  ) +\r\n  scale_size_binned(\r\n    name = \"Population (in millons)\",\r\n    breaks = seq(0, 1500, 300),\r\n    limits = c(0, 1500),\r\n    labels = format(seq(0, 1500, 300), scientific = FALSE, big.mark = \",\")\r\n  ) +\r\n  guides(\r\n    fill = guide_legend(\r\n      title = NULL, \r\n      label.position = \"left\",\r\n      label.hjust = 1,\r\n      override.aes = list(size = 2.5)\r\n    ),\r\n    size = guide_bins(\r\n      title.position = \"top\",\r\n      title.hjust = 1,\r\n      label.theme = element_text(size = 6.6, color = colorPrimary),\r\n      direction = \"horizontal\",\r\n      override.aes = list(fill = \"#BDBDBD\")\r\n    )\r\n  ) +\r\n  labs(\r\n    title = \"Getting better, but not enough\",\r\n    subtitle = paste0(\r\n      \"Life expectancy (in years) and GDP per capita (in international \",\r\n      \"dollars in 2005 prices)\\nYear: {frame_time}\"    \r\n    ),\r\n    x = \"GDP per capita\\n(in log scale)\",\r\n    y = \"Life expectancy\",\r\n    caption = \"Chart: Dzulfiqar Fathur Rahman | Source: Gapminder\"\r\n  ) +\r\n  theme(\r\n    text = element_text(size = 12, color = colorPrimary),\r\n    axis.title = element_text(size = rel(0.75)),\r\n    axis.text = element_text(size = rel(0.75), color = colorPrimary),\r\n    axis.line.x = element_line(color = \"black\"),\r\n    axis.ticks.x = element_line(color = \"black\"),\r\n    axis.ticks.y = element_blank(),\r\n    panel.background = element_rect(fill = \"#FFFFFF\"),\r\n    panel.grid.major.x  = element_line(color = colorPrimaryLight),\r\n    panel.grid.major.y = element_line(color = colorPrimaryLight),\r\n    panel.grid.minor = element_blank(),\r\n    plot.title = element_text(\r\n      face = \"bold\", \r\n      size = rel(1),\r\n      color = \"black\", \r\n      margin = margin(b = 5)\r\n    ),\r\n    plot.subtitle = element_text(\r\n      size = rel(0.75), \r\n      color = colorPrimary, \r\n      margin = margin(b = 5)\r\n    ),\r\n    plot.title.position = \"plot\",\r\n    plot.caption = element_text(\r\n      size = rel(0.7),\r\n      color = \"#9E9E9E\",\r\n      hjust = 0,\r\n      margin = margin(t = 5)\r\n    ),\r\n    plot.caption.position = \"plot\",\r\n    legend.margin = margin(0, unit = \"mm\"),\r\n    legend.title = element_text(size = rel(0.7)),\r\n    legend.text = element_text(size = rel(0.7)),\r\n    legend.key = element_blank(),\r\n    legend.key.height = unit(0.35, \"mm\"),\r\n    legend.position = c(0.75, 0.4),\r\n    legend.justification = \"left\",\r\n    plot.margin = margin(0, unit = \"mm\")\r\n  )\r\n\r\nplotGapminderAnimated <- plotGapminder +\r\n  transition_time(year) +\r\n  ease_aes()\r\n\r\nanim_save(\r\n  \"life-expectancy-income-per-cap.gif\",\r\n  animation = plotGapminderAnimated,\r\n  width = 6,\r\n  height = 3.708,\r\n  units = \"in\",\r\n  res = 150\r\n)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-09-21-my-data-visualizations-in-2020/images/preview-my-dataviz-in-2020.png",
    "last_modified": "2022-05-25T15:56:20+07:00",
    "input_file": {},
    "preview_width": 1280,
    "preview_height": 640
  }
]
