[
  {
    "path": "posts/2022-03-18-my-data-driven-stories-on-the-jakarta-post/",
    "title": "My data-driven stories on The Jakarta Post",
    "description": "A recap of my data journalism at The Jakarta Post between 2021 and 2022. From the COVID-19 pandemic's impact on wages to the decline in homeownership",
    "author": [],
    "date": "2022-03-18",
    "categories": [
      "data-visualization",
      "data-journalism",
      "The-Jakarta-Post"
    ],
    "contents": "\r\nDo you know that The Jakarta Post (JakPost) has been publishing data-driven stories? JakPost did not have a data journalism desk or section on the website and the newspaper. But my colleagues and I had been wrangling data to find stories.\r\nThis post compiles the data visualizations from my 14 selected stories between mid-2021 and March 2022. Since there was no data journalism desk, I worked on these stories with the business desk. So my stories are largely related to the impact of COVID-19 on livelihoods.\r\nWhen working on these stories, I was still learning and trying to figure out some stuff. (Actually, I still do.) Writing this post, therefore, has allowed me to not just look back at what I’ve achieved, but also see what I could have done better. As a result, I recreated the charts and map with a couple improvements where necessary.\r\nYou can find the code and data behind these visualizations in this GitHub repository. The repo also tells you the changes I’ve made to them.\r\nEnjoy!\r\nIndonesia remains Java-centric despite Jokowi’s infrastructure campaign\r\nMay 23, 2021\r\nRead the story on this link.\r\nThe first chart in this story shows that population and economic development had remained too concentrated in Java between 1971 and 2020.\r\n\r\n\r\n\r\nThe second chart shows that provinces with a higher per capita income tended to have more incoming lifetime migrants relative to their population.\r\n\r\n\r\n\r\nThe following map shows that lifetime migrants also tended to choose neighboring provinces or the ones closest to their home.\r\n\r\n\r\n\r\nCOVID-19 takes severe toll on wages\r\nJune 14, 2021\r\nRead the story on this link.\r\nThe first chart in this story shows that the average net wage in real terms declined in August 2020 from a year earlier, while the unemployment rate rose sharply to a level not seen at least in the past four years.\r\n\r\n\r\n\r\nThe second chart shows that sectors that fared better, such as information and communication, recorded a smaller decline in its real wage. Meanwhile, hard-hit sectors like transportation and storage recorded a steeper decline in its real wage.\r\n\r\n\r\n\r\nThe next chart shows that while the average net wage in the majority of provinces stayed above the minimum wage in nominal terms, it fell to a level below the floor in Jakarta or even further below the floor in some provinces, such as West Sulawesi.\r\n\r\n\r\n\r\nIndonesian homeownership slides as affordability issues arise\r\nJune 28, 2021\r\nRead the story on this link.\r\nThe first chart in this story shows that homeownership slightly fell between 1999 and 2020 in general. Bali and Jakarta recorded a significant decline, while Bengkulu and Jambi recorded a small increase in homeownership.\r\n\r\n\r\n\r\nThe next chart shows that house prices had been growing at a slower pace at least since 2014. In Bandar Lampung, Lampung, house prices declined during the pandemic.\r\n\r\n\r\n\r\nThe next chart shows that the average monthly mortgage payment in Jakarta and Yogyakarta was unusually high in 2019, given the mortgage terms.\r\n\r\n\r\n\r\nFactory imports show recovery uncertainty\r\nJuly 1, 2021\r\nRead the story on this link.\r\nThis chart shows that imports of raw materials and capital goods had not shown a promising sign of recovery as of April 2021. While imports of raw materials continued to pick up pace, imports of capital goods did not.\r\n\r\n\r\n\r\nWealth gap narrows in Indonesia as stock market slumps, house prices grow\r\nJuly 12, 2021\r\nRead the story on this link.\r\nThe first chart in this story shows the estimated wealth distribution in Indonesia between 2019 and 2020. As the share of wealth of the bottom 40 percent slightly expanded while that of the richest 10 percent shrank, the wealth gap was estimated to narrow.\r\n\r\n\r\n\r\nThe second chart shows that wealth per adult in Indonesia continued to grow despite at a slower pace during the pandemic. The growth hinged largely on nonfinancial assets like houses.\r\n\r\n\r\n\r\nSlow vaccination takes toll on Indonesia in uneven global recovery\r\nAugust 1, 2021\r\nRead the story on this link.\r\nThe first chart in this story shows that the International Monetary Fund (IMF) revised downward the 2021 economic growth forecast for Indonesia in its July outlook from the previous one. Indonesia joined other countries with a downward revision, such as India and neighboring Malaysia.\r\n\r\n\r\n\r\nThe second chart shows that Indonesia, like other low and lower-middle income countries, was falling behind its richer peers in inoculating its citizens against COVID-19. This trend is associated with the growth outlook.\r\n\r\n\r\n\r\nEmergency curbs reverse recovery in consumer confidence, retail sales\r\nAugust 12, 2021\r\nRead the story on this link.\r\nThe first chart in this story shows that the Delta wave, which peaked in July 2021, interrupted the recovery in consumer confidence and retail sales. The consumer confidence index fell back to a level nearly as pessimistic as in October 2020. The retail sales index also contracted again compared with a year earlier.\r\n\r\n\r\n\r\nThe next chart shows that visitors to retail and recreation places started declining in June, even before the government tightened mobility restrictions as cases surged, especially in Java and Bali.\r\n\r\n\r\n\r\nIndonesia lags behind in decoupling economic and emission growth\r\nSeptember 5, 2021\r\nRead the story on this link.\r\nThe first chart in this story shows that Indonesia had not been able to grow its economy without slowing down both production and consumption-based CO2 emissions between 1990 and 2020. Meanwhile, other countries had managed to do so. Some countries, such as Singapore, developed their economy while reducing its emissions.\r\n\r\n\r\n\r\nThe following chart shows that Indonesia’s human development index (HDI) might be below the threshold of high-human development if we accounted for emission and material footprint.\r\n\r\n\r\n\r\nMajority of affluent Indonesians plan to retire early\r\nDecember 11, 2021\r\nRead the story on this link.\r\nThis chart shows that the share of affluent individuals planning to retire before turning 65 was highest in Indonesia among the surveyed countries. As a result, the share of these individuals who had not started saving or investing for retirement was very low in the country.\r\n\r\n\r\n\r\nYearender 2021: How the Delta wave disrupted Indonesia’s economic recovery\r\nDecember 26, 2021\r\nRead the story on this link.\r\nThis chart shows how the Delta wave hit Indonesia when the rate of vaccination against the virus was still very low. This forced the government to tighten mobility restrictions. As a result, the country recorded a slower economic growth in the July to September period in 2021 than the previous quarter.\r\n\r\n\r\n\r\nHow China beats US as trade, investment partner for Indonesia\r\nJanuary 4, 2022\r\nRead the story on this link.\r\nThe first chart in this story shows that the share of Indonesia’s exports to and imports from China started growing in early 2000s, following the latter’s accession to the World Trade Organization (WTO). By late 2000s, the share of trade with China was larger than that with the United States (US).\r\n\r\n\r\n\r\nThe next chart shows that net foreign direct investment (FDI) flow from China to Indonesia largely remained positive between 2010 and 2020. Meanwhile, the flow from the US showed a downward trend in general.\r\n\r\n\r\n\r\nDomestic travelers ‘not enough’ to revive Bali tourism\r\nJanuary 18, 2022\r\nRead the story on this link.\r\nThis chart shows the large share of foreign guests at star-rated and other hotels in Bali in 2019. As a popular international tourist destination, the province was heavily dependent on foreign tourists.\r\n\r\n\r\n\r\nCOVID-19 expedites deindustrialization in Indonesia\r\nFebruary 9, 2022\r\nRead the story on this link.\r\nThis chart shows the premature deindustrialization that started taking place in Indonesia in mid-2000s, as suggested by the share of manufacturing value added in real gross domestic product (GDP), and how the pandemic worsened it.\r\n\r\n\r\n\r\nCOVID-19 pulls more workers into low-paying service sector jobs\r\nMarch 5, 2022\r\nRead the story on this link.\r\nThis chart shows that most Indonesian workers in services had less than a college educational attainment in 2021. These workers were concentrated in traditional and low-paying sectors, such as accommodation and food service activities, transportation and storage, and wholesale and retail trade.\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-03-18-my-data-driven-stories-on-the-jakarta-post/images/jakpost-graphics.png",
    "last_modified": "2022-03-18T01:12:35+07:00",
    "input_file": {},
    "preview_width": 1280,
    "preview_height": 640
  },
  {
    "path": "posts/2021-09-21-my-data-visualizations-in-2020/",
    "title": "My dataviz in 2020",
    "description": "One scatter plot, one animated scatter plot, one map and one table on industrial park, COVID-19 and well-being",
    "author": [],
    "date": "2021-09-21",
    "categories": [
      "data-visualization",
      "Datawrapper",
      "ggplot2",
      "gganimate",
      "The-Jakarta-Post"
    ],
    "contents": "\r\nI created dozens of data visualizations on various topics in 2020 both for work and personal projects. From COVID-19 to industrial park.\r\nI published my first “data-driven story” on poverty in Jakarta on The Jakarta Post in February last year. Aside from analyzing data and creating visualizations for work, I also do it outside work, mostly for learning. I usually publish the result on my Twitter account.\r\nHere’s my favorite data visualizations from last year, with a few improvements.\r\n\r\n\r\n\r\n\r\n\r\n\r\nTwitter\r\n\r\nJune 20, 2020\r\n\r\n\r\n\r\n\r\n!function(){\"use strict\";window.addEventListener(\"message\",(function(e){if(void 0!==e.data[\"datawrapper-height\"]){var t=document.querySelectorAll(\"iframe\");for(var a in e.data[\"datawrapper-height\"])for(var r=0;r<t.length;r++){if(t[r].contentWindow===e.source)t[r].style.height=e.data[\"datawrapper-height\"][a]+\"px\"}}}))}();\r\n\r\n\r\n\r\nThe Jakarta Post\r\n\r\nJuly 17, 2020\r\n\r\n\r\n\r\n\r\n!function(){\"use strict\";window.addEventListener(\"message\",(function(a){if(void 0!==a.data[\"datawrapper-height\"])for(var e in a.data[\"datawrapper-height\"]){var t=document.getElementById(\"datawrapper-chart-\"+e)||document.querySelector(\"iframe[src*='\"+e+\"']\");t&&(t.style.height=a.data[\"datawrapper-height\"][e]+\"px\")}}))}();\r\n\r\n\r\n\r\nTwitter\r\n\r\nJuly 19, 2020\r\n\r\n\r\n\r\n\r\n!function(){\"use strict\";window.addEventListener(\"message\",(function(e){if(void 0!==e.data[\"datawrapper-height\"]){var t=document.querySelectorAll(\"iframe\");for(var a in e.data[\"datawrapper-height\"])for(var r=0;r<t.length;r++){if(t[r].contentWindow===e.source)t[r].style.height=e.data[\"datawrapper-height\"][a]+\"px\"}}}))}();\r\n\r\n\r\n\r\n\r\n\r\n\r\nTwitter\r\n\r\nSep. 9, 2020\r\n\r\n\r\n\r\n\r\n\r\nShow code\r\n\r\n# Packages ----\r\n\r\nlibrary(tidyverse)\r\nlibrary(gapminder)\r\nlibrary(gganimate)\r\n\r\n\r\n# Data ----\r\n\r\nasean5 <- c(\"Singapore\", \"Philippines\", \"Thailand\", \"Malaysia\")\r\n\r\ngapminderGrouped <- gapminder %>% \r\n  mutate(\r\n    pop = pop / 1000000,\r\n    group = case_when(\r\n      country == \"Indonesia\" ~ \"Indonesia\",\r\n      country %in% asean5 ~ \"ASEAN-5\",\r\n      TRUE ~ \"Rest of the world\"\r\n    )\r\n  )\r\n\r\n\r\n# Chart ----\r\n\r\ncolorPrimary <- \"#757575\"\r\ncolorPrimaryLight <- \"#E0E0E0\"\r\n\r\naxisBreakX <- c(100, 1000, 10000, 100000, 1000000)\r\n\r\nplotGapminder <- ggplot(\r\n  data = gapminderGrouped, \r\n  mapping = aes(x = gdpPercap, y = lifeExp)\r\n) +\r\n  geom_point(\r\n    mapping = aes(fill = group, size = pop),\r\n    pch = 21, \r\n    color = \"white\", \r\n    alpha = 0.85\r\n  ) +\r\n  scale_x_log10(\r\n    breaks = axisBreakX,\r\n    labels = format(axisBreakX, scientific = FALSE, big.mark = \",\"),\r\n    limits = c(100, 1000000)\r\n  ) +\r\n  scale_y_continuous(\r\n    breaks = seq(0, 100, 20),\r\n    limits = c(0, 100),\r\n    expand = c(0, 0),\r\n    position = \"right\"\r\n  ) +\r\n  scale_fill_manual(\r\n    values = c(\r\n      \"Indonesia\" = \"#2477B3\",\r\n      \"ASEAN-5\" = \"#55CBF2\",\r\n      \"Rest of the world\" = \"#BDBDBD\"\r\n    )\r\n  ) +\r\n  scale_size_binned(\r\n    name = \"Population (in millons)\",\r\n    breaks = seq(0, 1500, 300),\r\n    limits = c(0, 1500),\r\n    labels = format(seq(0, 1500, 300), scientific = FALSE, big.mark = \",\")\r\n  ) +\r\n  guides(\r\n    fill = guide_legend(\r\n      title = NULL, \r\n      label.position = \"left\",\r\n      label.hjust = 1,\r\n      override.aes = list(size = 2.5)\r\n    ),\r\n    size = guide_bins(\r\n      title.position = \"top\",\r\n      title.hjust = 1,\r\n      label.theme = element_text(size = 6.6, color = colorPrimary),\r\n      direction = \"horizontal\",\r\n      override.aes = list(fill = \"#BDBDBD\")\r\n    )\r\n  ) +\r\n  labs(\r\n    title = \"Getting better, but not enough\",\r\n    subtitle = paste0(\r\n      \"Life expectancy (in years) and GDP per capita (in international \",\r\n      \"dollars in 2005 prices)\\nYear: {frame_time}\"    \r\n    ),\r\n    x = \"GDP per capita\\n(in log scale)\",\r\n    y = \"Life expectancy\",\r\n    caption = \"Chart: Dzulfiqar Fathur Rahman | Source: Gapminder\"\r\n  ) +\r\n  theme(\r\n    text = element_text(size = 12, color = colorPrimary),\r\n    axis.title = element_text(size = rel(0.75)),\r\n    axis.text = element_text(size = rel(0.75), color = colorPrimary),\r\n    axis.line.x = element_line(color = \"black\"),\r\n    axis.ticks.x = element_line(color = \"black\"),\r\n    axis.ticks.y = element_blank(),\r\n    panel.background = element_rect(fill = \"#FFFFFF\"),\r\n    panel.grid.major.x  = element_line(color = colorPrimaryLight),\r\n    panel.grid.major.y = element_line(color = colorPrimaryLight),\r\n    panel.grid.minor = element_blank(),\r\n    plot.title = element_text(\r\n      face = \"bold\", \r\n      size = rel(1),\r\n      color = \"black\", \r\n      margin = margin(b = 5)\r\n    ),\r\n    plot.subtitle = element_text(\r\n      size = rel(0.75), \r\n      color = colorPrimary, \r\n      margin = margin(b = 5)\r\n    ),\r\n    plot.title.position = \"plot\",\r\n    plot.caption = element_text(\r\n      size = rel(0.7),\r\n      color = \"#9E9E9E\",\r\n      hjust = 0,\r\n      margin = margin(t = 5)\r\n    ),\r\n    plot.caption.position = \"plot\",\r\n    legend.margin = margin(0, unit = \"mm\"),\r\n    legend.title = element_text(size = rel(0.7)),\r\n    legend.text = element_text(size = rel(0.7)),\r\n    legend.key = element_blank(),\r\n    legend.key.height = unit(0.35, \"mm\"),\r\n    legend.position = c(0.75, 0.4),\r\n    legend.justification = \"left\",\r\n    plot.margin = margin(0, unit = \"mm\")\r\n  )\r\n\r\nplotGapminderAnimated <- plotGapminder +\r\n  transition_time(year) +\r\n  ease_aes()\r\n\r\nanim_save(\r\n  \"life-expectancy-income-per-cap.gif\",\r\n  animation = plotGapminderAnimated,\r\n  width = 6,\r\n  height = 3.708,\r\n  units = \"in\",\r\n  res = 150\r\n)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-09-21-my-data-visualizations-in-2020/images/my-dataviz-in-2020.png",
    "last_modified": "2022-03-17T00:12:07+07:00",
    "input_file": {},
    "preview_width": 1280,
    "preview_height": 640
  }
]
